package ex0517;

public class Ex0517 {
	/*필기
	 * 메서드  //속성과 동작 중 동작..//
		 * - 객체의 동작을 실행 블럭으로 선언(혹은 정의)하는 것을 말한다.
		 * - 메서드를 호출(실행)한다 -> 메서드를 실행한다.
		 * - 객체의 내/외부에서 호출이 가능하다.
		 * - 객체간의 상호작용이다.
	 * 
	 * 형태: ****return타입이 있는 경우// 
	 	--> 선언부:메서드 이름(매개변수들어갈 자리){  (코드가 들어가는 부분이 구연부)
	 		코드실행되는 부분
	 		return 타입; (타입종류: int, double, String, boolean 등)
	 		
	 		}
	 		****return타입이 없는 경우// 
	 		void 메소드 이름()(매개변수들어갈 자리){
	 		코드실행되는 부분
	 		return을 생략한다.
	 	
	 	
	 	
	 	* 메서드 ***********오버로딩************
	 	- 메서드 이름은 같으나 
	 	매개변수의 타입, 갯수, 순서가 다른 메서드를 선언하는 것을 말한다.
	 	- 리턴타입 상관없음.
	 	- 다양한 매개값을 처리하기 위해서 사용한다.
	 	- 동명이인 같은 개념..
	 	- 대표적인 예)  System.out.println();
	 		println(int x){...}
	 		println(String x){...}
	 		println(double x){...}
	 		println(){}
	 		println(){}
	 	
	 	****인스턴스 멤버(변수/ 메서드)****
	 	*	- 객체에 속한 멤버: 객체 생성을 해야'만' 사용이 가능하다.	
	 	*	- 지금까지 사용한 모든 변수/메서드
	 	*
	 	****정적 멤버(변수/ 메서드) ****
	 	*	-  static
	 	*	-  클래스에 고정된 멤버: 객체 생성 없이 사용 가능.
	 	*	-  static이 붙어있으면 붙어있는 그 자체로 실행이 가능해진다.
	 	
	 	
	 	
	 	
	 	
	 	
	 	
	 	
	 	
	 * */

}
